particle-iot/device-os/hal/src/nRF52840/usart_hal.cpp
    int end() {
        CHECK_TRUE(state_ != HAL_USART_STATE_DISABLED, SYSTEM_ERROR_INVALID_STATE);
        AtomicSection lk;

        CHECK(disable());

        state_ = HAL_USART_STATE_DISABLED;
        transmitting_ = false;
        usingAltRxBuffer_ = false;
        config_ = {};
        rxBuffer_.reset();
        rxBufferAlt_.reset();
        txBuffer_.reset();

        return SYSTEM_ERROR_NONE;
    }

    int suspend() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        
        flush();

        AtomicSection lk;

        // Update current available received data
        data();
        CHECK(disable(false));

        state_ = HAL_USART_STATE_SUSPENDED;
        transmitting_ = false;
        rxBuffer_.prune();
        rxBufferAlt_.prune();
        txBuffer_.reset();

        return SYSTEM_ERROR_NONE;
    }

    int restore() {
        AtomicSection lk;
        CHECK_TRUE(state_ == HAL_USART_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        return begin(config_);
    }

    ssize_t data() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        RxLock lk(uarte_);
        particle::services::RingBuffer<uint8_t>* currRxBuff = nullptr;
        particle::services::RingBuffer<uint8_t>* preRxBuff = nullptr;
        acquireRxBuffer(&currRxBuff, &preRxBuff);
        ssize_t d = preRxBuff->data() + currRxBuff->data();
        if (receiving_) {
            // IMPORTANT: It seems that the timer value (which is a counter for every time UARTE generates RXDRDY event)
            // may potentially get larger than the configured RX DMA transfer:
            // <quote>
            // For each byte received over the RXD line, an RXDRDY event will be generated.
            // This event is likely to occur before the corresponding data has been transferred to Data RAM.
            // </quote>
            // We'll be extra careful here and make sure not to consume more than we can, otherwise
            // we may put the ring buffer into an invalid state as there are not safety checks.
            uint16_t timerCount = timerValue();
            uint16_t toConsumeCount;
            if (timerCount >= consumedTimerCount_) {
                toConsumeCount = timerCount - consumedTimerCount_;
            } else {
                toConsumeCount = 65536 - consumedTimerCount_ + timerCount;
            }
            const ssize_t toConsume = std::min(currRxBuff->acquirePending(), (size_t)toConsumeCount);
            if (toConsume > 0) {
                currRxBuff->acquireCommit(toConsume);
                d += toConsume;
                consumedTimerCount_ = (consumedTimerCount_ + toConsume) % 65536;
            }
        }
        return d;
    }

    ssize_t space() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        TxLock lk(uarte_);
        return txBuffer_.space();
    }

    ssize_t read(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        const size_t readSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(readSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(uarte_);
        particle::services::RingBuffer<uint8_t>* currRxBuff = nullptr;
        particle::services::RingBuffer<uint8_t>* preRxBuff = nullptr;
        acquireRxBuffer(&currRxBuff, &preRxBuff);
        ssize_t remainLen = preRxBuff->data();
        SCOPE_GUARD ({
            if (remainLen == 0 && !(uarte_->SHORTS & NRF_UARTE_SHORT_ENDRX_STARTRX)) {
                prepareNextRingBuffer();
                nrf_uarte_shorts_enable(uarte_, NRF_UARTE_SHORT_ENDRX_STARTRX);
            }
        });
        ssize_t r = CHECK(preRxBuff->get(buffer, std::min((size_t)remainLen, readSize)));
        if (r >= 0 && r < (ssize_t)readSize) {
            r += CHECK(currRxBuff->get(buffer + r, readSize - r));
        }
        return r;
    }

    ssize_t peek(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        const size_t peekSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(peekSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(uarte_);
        particle::services::RingBuffer<uint8_t>* currRxBuff = nullptr;
        particle::services::RingBuffer<uint8_t>* preRxBuff = nullptr;
        acquireRxBuffer(&currRxBuff, &preRxBuff);
        ssize_t remainLen = preRxBuff->data();
        if (remainLen) {
            return preRxBuff->peek(buffer, peekSize);
        } else {
            return currRxBuff->peek(buffer, peekSize);
        }
    }

    ssize_t write(const uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t canWrite = CHECK(space());
        const size_t writeSize = std::min((size_t)canWrite, size);
        CHECK_TRUE(writeSize > 0, SYSTEM_ERROR_NO_MEMORY);
        ssize_t r;
        {
            TxLock lk(uarte_);
            r = CHECK(txBuffer_.put(buffer, writeSize));
        }
        // Start transmission
        startTransmission();
        return r;
    }

    ssize_t flush() {
        while (true) {
            while (transmitting_) {
                // FIXME: busy loop
            }
            {
                TxLock lk(uarte_);
                if (!isEnabled() || txBuffer_.empty()) {
                    break;
                }
            }
        }
        return 0;
    }

    bool isConfigured() const {
        return configured_;
    }

    bool isEnabled() const {
        return state_ == HAL_USART_STATE_ENABLED;
    }

    void pump() {
        if (!willPreempt() && isEnabled()) {
            interruptHandler();
        }
    }

    void interruptHandler() {
        BaseType_t yield = pdFALSE;
        bool eventGenerated = false;

        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_RXDRDY_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_RXDRDY)) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);
                if (xEventGroupSetBitsFromISR(evGroup_, HAL_USART_PVT_EVENT_READABLE, &yield) != pdFAIL) {
                    eventGenerated = true;
                }
            }
        }

